rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_DMA_TCD.h
#define DMA_TCD_TCD31_CITER_ELINKYES_LINKCH_MASK (0x3E00U)
#define DMA_TCD_TCD31_CITER_ELINKYES_LINKCH_SHIFT (9U)
#define DMA_TCD_TCD31_CITER_ELINKYES_LINKCH_WIDTH (5U)
#define DMA_TCD_TCD31_CITER_ELINKYES_LINKCH(x)   (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD31_CITER_ELINKYES_LINKCH_SHIFT)) & DMA_TCD_TCD31_CITER_ELINKYES_LINKCH_MASK)

#define DMA_TCD_TCD31_CITER_ELINKYES_ELINK_MASK  (0x8000U)
#define DMA_TCD_TCD31_CITER_ELINKYES_ELINK_SHIFT (15U)
#define DMA_TCD_TCD31_CITER_ELINKYES_ELINK_WIDTH (1U)
#define DMA_TCD_TCD31_CITER_ELINKYES_ELINK(x)    (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD31_CITER_ELINKYES_ELINK_SHIFT)) & DMA_TCD_TCD31_CITER_ELINKYES_ELINK_MASK)
/*! @} */

/*! @name TCD31_DLAST_SGA - TCD Last Destination Address Adjustment / Scatter Gather Address */
/*! @{ */

#define DMA_TCD_TCD31_DLAST_SGA_DLAST_SGA_MASK   (0xFFFFFFFFU)
#define DMA_TCD_TCD31_DLAST_SGA_DLAST_SGA_SHIFT  (0U)
#define DMA_TCD_TCD31_DLAST_SGA_DLAST_SGA_WIDTH  (32U)
#define DMA_TCD_TCD31_DLAST_SGA_DLAST_SGA(x)     (((uint32_t)(((uint32_t)(x)) << DMA_TCD_TCD31_DLAST_SGA_DLAST_SGA_SHIFT)) & DMA_TCD_TCD31_DLAST_SGA_DLAST_SGA_MASK)
/*! @} */

/*! @name TCD31_CSR - TCD Control and Status */
/*! @{ */

#define DMA_TCD_TCD31_CSR_START_MASK             (0x1U)
#define DMA_TCD_TCD31_CSR_START_SHIFT            (0U)
#define DMA_TCD_TCD31_CSR_START_WIDTH            (1U)
#define DMA_TCD_TCD31_CSR_START(x)               (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD31_CSR_START_SHIFT)) & DMA_TCD_TCD31_CSR_START_MASK)

#define DMA_TCD_TCD31_CSR_INTMAJOR_MASK          (0x2U)
#define DMA_TCD_TCD31_CSR_INTMAJOR_SHIFT         (1U)
#define DMA_TCD_TCD31_CSR_INTMAJOR_WIDTH         (1U)
#define DMA_TCD_TCD31_CSR_INTMAJOR(x)            (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD31_CSR_INTMAJOR_SHIFT)) & DMA_TCD_TCD31_CSR_INTMAJOR_MASK)

#define DMA_TCD_TCD31_CSR_INTHALF_MASK           (0x4U)
#define DMA_TCD_TCD31_CSR_INTHALF_SHIFT          (2U)
#define DMA_TCD_TCD31_CSR_INTHALF_WIDTH          (1U)
#define DMA_TCD_TCD31_CSR_INTHALF(x)             (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD31_CSR_INTHALF_SHIFT)) & DMA_TCD_TCD31_CSR_INTHALF_MASK)

#define DMA_TCD_TCD31_CSR_DREQ_MASK              (0x8U)
#define DMA_TCD_TCD31_CSR_DREQ_SHIFT             (3U)
#define DMA_TCD_TCD31_CSR_DREQ_WIDTH             (1U)
#define DMA_TCD_TCD31_CSR_DREQ(x)                (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD31_CSR_DREQ_SHIFT)) & DMA_TCD_TCD31_CSR_DREQ_MASK)

#define DMA_TCD_TCD31_CSR_ESG_MASK               (0x10U)
#define DMA_TCD_TCD31_CSR_ESG_SHIFT              (4U)
#define DMA_TCD_TCD31_CSR_ESG_WIDTH              (1U)
#define DMA_TCD_TCD31_CSR_ESG(x)                 (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD31_CSR_ESG_SHIFT)) & DMA_TCD_TCD31_CSR_ESG_MASK)

#define DMA_TCD_TCD31_CSR_MAJORELINK_MASK        (0x20U)
#define DMA_TCD_TCD31_CSR_MAJORELINK_SHIFT       (5U)
#define DMA_TCD_TCD31_CSR_MAJORELINK_WIDTH       (1U)
#define DMA_TCD_TCD31_CSR_MAJORELINK(x)          (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD31_CSR_MAJORELINK_SHIFT)) & DMA_TCD_TCD31_CSR_MAJORELINK_MASK)

#define DMA_TCD_TCD31_CSR_ESDA_MASK              (0x80U)
#define DMA_TCD_TCD31_CSR_ESDA_SHIFT             (7U)
#define DMA_TCD_TCD31_CSR_ESDA_WIDTH             (1U)
#define DMA_TCD_TCD31_CSR_ESDA(x)                (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD31_CSR_ESDA_SHIFT)) & DMA_TCD_TCD31_CSR_ESDA_MASK)

#define DMA_TCD_TCD31_CSR_MAJORLINKCH_MASK       (0x1F00U)
#define DMA_TCD_TCD31_CSR_MAJORLINKCH_SHIFT      (8U)
#define DMA_TCD_TCD31_CSR_MAJORLINKCH_WIDTH      (5U)
#define DMA_TCD_TCD31_CSR_MAJORLINKCH(x)         (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD31_CSR_MAJORLINKCH_SHIFT)) & DMA_TCD_TCD31_CSR_MAJORLINKCH_MASK)

#define DMA_TCD_TCD31_CSR_BWC_MASK               (0xC000U)
#define DMA_TCD_TCD31_CSR_BWC_SHIFT              (14U)
#define DMA_TCD_TCD31_CSR_BWC_WIDTH              (2U)
#define DMA_TCD_TCD31_CSR_BWC(x)                 (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD31_CSR_BWC_SHIFT)) & DMA_TCD_TCD31_CSR_BWC_MASK)
/*! @} */

/*! @name TCD31_BITER_ELINKNO - TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled) */
/*! @{ */

#define DMA_TCD_TCD31_BITER_ELINKNO_BITER_MASK   (0x7FFFU)
#define DMA_TCD_TCD31_BITER_ELINKNO_BITER_SHIFT  (0U)
#define DMA_TCD_TCD31_BITER_ELINKNO_BITER_WIDTH  (15U)
#define DMA_TCD_TCD31_BITER_ELINKNO_BITER(x)     (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD31_BITER_ELINKNO_BITER_SHIFT)) & DMA_TCD_TCD31_BITER_ELINKNO_BITER_MASK)

#define DMA_TCD_TCD31_BITER_ELINKNO_ELINK_MASK   (0x8000U)
#define DMA_TCD_TCD31_BITER_ELINKNO_ELINK_SHIFT  (15U)
#define DMA_TCD_TCD31_BITER_ELINKNO_ELINK_WIDTH  (1U)
#define DMA_TCD_TCD31_BITER_ELINKNO_ELINK(x)     (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD31_BITER_ELINKNO_ELINK_SHIFT)) & DMA_TCD_TCD31_BITER_ELINKNO_ELINK_MASK)
/*! @} */

/*! @name TCD31_BITER_ELINKYES - TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled) */
/*! @{ */

#define DMA_TCD_TCD31_BITER_ELINKYES_BITER_MASK  (0x1FFU)
#define DMA_TCD_TCD31_BITER_ELINKYES_BITER_SHIFT (0U)
#define DMA_TCD_TCD31_BITER_ELINKYES_BITER_WIDTH (9U)
#define DMA_TCD_TCD31_BITER_ELINKYES_BITER(x)    (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD31_BITER_ELINKYES_BITER_SHIFT)) & DMA_TCD_TCD31_BITER_ELINKYES_BITER_MASK)

#define DMA_TCD_TCD31_BITER_ELINKYES_LINKCH_MASK (0x3E00U)
#define DMA_TCD_TCD31_BITER_ELINKYES_LINKCH_SHIFT (9U)
#define DMA_TCD_TCD31_BITER_ELINKYES_LINKCH_WIDTH (5U)
#define DMA_TCD_TCD31_BITER_ELINKYES_LINKCH(x)   (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD31_BITER_ELINKYES_LINKCH_SHIFT)) & DMA_TCD_TCD31_BITER_ELINKYES_LINKCH_MASK)

#define DMA_TCD_TCD31_BITER_ELINKYES_ELINK_MASK  (0x8000U)
#define DMA_TCD_TCD31_BITER_ELINKYES_ELINK_SHIFT (15U)
#define DMA_TCD_TCD31_BITER_ELINKYES_ELINK_WIDTH (1U)
#define DMA_TCD_TCD31_BITER_ELINKYES_ELINK(x)    (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD31_BITER_ELINKYES_ELINK_SHIFT)) & DMA_TCD_TCD31_BITER_ELINKYES_ELINK_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group DMA_TCD_Register_Masks */

/*!
 * @}
 */ /* end of group DMA_TCD_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K388_DMA_TCD_H_) */
